{
  "name": "Tech Research",
  "description": "Use the powerful Asembly Table to craft Augumentations to advance your kwoledge",
  "quests": [
    {
      "name": "Time to go Modular!",
      "description": "Building your first base is a very proud moment. You can quite rightly admire everything you have made. Sadly its not going to last since the increasing types of ores and other materials you encounter will require a flexible approach to base building. It would be best if you could re-configure machines to reflect your current needs. Thankfully now you can with modular systems. ",
      "x": 112,
      "y": 10,
      "icon": {
        "id": "modularsystems:dummyIO"
      },
      "requirements": [
        2
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Bricks down in the black and red area",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "Forestry",
      "description": "Sick of the division created by the warring tribes, Jahl Sengir lead a few of the larger, peaceloving families to seek the tranquillity of the sprawling forests deep in the South of Agartha.Whilst Agartha was home to a wide variety of flora and fauna, the Agrilahn?s believed in thedevelopment of new strains of plant and animal focussing their technical advances onbreeding new types of bee to pollinate new strains of tree. Farming was central to theirdevelopment too, and soon the Agrilahn?s were a trading power house as demand grew fortheir automatically farmed produce.",
      "x": 15,
      "y": 10,
      "icon": {
        "id": "Forestry:core"
      },
      "requirements": [
        2
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Spruce Tree",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "BuildCraft",
      "description": "One of the ruling Outcast families lead by Jarl SpaceToad began automation long beforeother tribes. With a focus on automating resource gathering, storage and processingSpaceToad?s tribe begin to amass great wealth bringing opportunity for its people. Over timeother technologies proved to be more advanced but the lure of simple automation andengineering still proves strong today for many of the chosen.TaskIn order for you to prove yourself a competent buildcraft technician you need to prove that you can craft some essential components. Using all your skills and substantial resources craft20 steel ingots and deposit them in the relevant locked chest in the Parthenon.",
      "x": 157,
      "y": 6,
      "icon": {
        "id": "BuildCraft|Core:engineBlock",
        "damage": 2
      },
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "In order for you to prove yourself a competent buildcraft technician you need to prove that you can craft some essential components. Using all your skills and substantial resources craft 20 steel ingots and deposit them using the akashic.                                                                    Your reward for advancing the BuildCraft technology will be the ability to craft augmentations that will open many more technical doors for you and start your exploration and technical augmentation. Completion of the BuildCraft quest will unlock access to the second tier of quests including, Forestry, ProjectRed, Additions, Immersive Engineering, Railcraft and ComputerCraft. First Door in the tech area on the right marked by a Wrench, You will find the room.",
          "items": [
            {
              "item": {
                "id": "TConstruct:materials",
                "damage": 16
              },
              "required": 20,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ]
    },
    {
      "name": "Immersive Intergration",
      "description": "One of Dr Damien Hazard?s lead engineers, a committed pacifist and active politician called UnwantedFun, impressed by the advances made by his mentor but unhappy with the deep segregation being caused by the varying, decided to commit his efforts to bridging the gaps between the various technologies and embark on a programme of technical integration between them all.  His technology was to bring the Outcast tribes closer together enabling the Immersive Engineering technologies to be used alongside AE2 and various others.",
      "x": 111,
      "y": 55,
      "icon": {
        "id": "immersiveintegration:extendedPost"
      },
      "requirements": [
        4,
        8
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Immersive Engineering",
      "description": "Working alongside Jahl SpaceToad as his right-hand man for many years, Doctor Damien Hazard was given the Blessings of the Tribe to take his family and develop complementary technologies, renewable power generation, mining and other ore processing machines.  Taking with him a core of highly competent engineers, Doctor Hazard began a period of intensive development and advancement taking mining and ore gathering to new levels of efficiency and opening deeper and deeper mines in Agartha over the following years.",
      "x": 157,
      "y": 30,
      "icon": {
        "id": "ImmersiveEngineering:metalDevice",
        "damage": 5
      },
      "requirements": [
        0,
        11
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a Tesla Coil",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 15
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 30
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ImmersiveEngineering:tool",
          "damage": 3
        }
      ]
    },
    {
      "name": "ElectriCraft",
      "description": "In conjunction with Rotarycraft this knowledge will allow you to transport power in the most sensible ways. Just ask ?No Brows Smith? about the need to get it right. As the priest said at his funeral. He was a bright spark who went out with a bang! ",
      "x": 61,
      "y": 143,
      "icon": {
        "id": "ElectriCraft:electricraft_item_placer",
        "damage": 9
      },
      "requirements": [
        27,
        31
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Make XXX of YYY to be handed in and then use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            },
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 10
            }
          ]
        }
      ]
    },
    {
      "name": "Extra Bees And Trees",
      "description": "Growing in confidence and skill, the Agrilahn specialised deeper into developing specificstrains of bee to produce resource that could further enhance their standing in the World andtheir pursuit of knowledge and excellence. Principal Apiarist, MysteriousAges, lead researchthat suggested that rare strains of magical bee could be created to produce rare resources totrade and further develop their specialist technologies. His advances encouraged other leadApiarists to take their crafts further with noted successes in Arbory by Joseph Sinclair and inApiculture by the 8th son of MysteriousAges, known as Binnie.",
      "x": 15,
      "y": 55,
      "icon": {
        "id": "Forestry:beeDroneGE",
        "nbt": "{MaxH:30,Health:30,IsAnalyzed:1b,Genome:{Chromosomes:[0:{UID1:\"extrabees.species.copper\",UID0:\"extrabees.species.copper\",Slot:0b},1:{UID1:\"forestry.speedSlowest\",UID0:\"forestry.speedSlowest\",Slot:1b},2:{UID1:\"forestry.lifespanShort\",UID0:\"forestry.lifespanShort\",Slot:2b},3:{UID1:\"forestry.fertilityLow\",UID0:\"forestry.fertilityLow\",Slot:3b},4:{UID1:\"forestry.toleranceBoth2\",UID0:\"forestry.toleranceBoth2\",Slot:4b},5:{UID1:\"forestry.boolTrue\",UID0:\"forestry.boolTrue\",Slot:5b},6:{UID1:\"forestry.toleranceBoth2\",UID0:\"forestry.toleranceBoth2\",Slot:7b},7:{UID1:\"forestry.boolTrue\",UID0:\"forestry.boolTrue\",Slot:8b},8:{UID1:\"forestry.boolTrue\",UID0:\"forestry.boolTrue\",Slot:9b},9:{UID1:\"extrabees.flower.rock\",UID0:\"extrabees.flower.rock\",Slot:10b},10:{UID1:\"forestry.floweringSlowest\",UID0:\"forestry.floweringSlowest\",Slot:11b},11:{UID1:\"forestry.territoryDefault\",UID0:\"forestry.territoryDefault\",Slot:12b},12:{UID1:\"forestry.effectNone\",UID0:\"forestry.effectNone\",Slot:13b}]}}"
      },
      "requirements": [
        1,
        8
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Leaves",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Genetics",
      "description": "Principal Engineer and Apiculturist, Binnie, began to desire an even greater level of control ofhis craft and so lead a small team to develop a higher level of machine and technology toenable them to examine and manipulate the very DNA of their bees. Absolute mastery of theforest would require mastery of genetics.",
      "x": 60,
      "y": 113,
      "icon": {
        "id": "Genetics:serumArray",
        "nbt": "{genes:[0:{allele:\"forestry.speciesForest\",root:\"rootBees\",chromo:0b},1:{allele:\"forestry.speedSlowest\",root:\"rootBees\",chromo:1b},2:{allele:\"forestry.lifespanShorter\",root:\"rootBees\",chromo:2b},3:{allele:\"forestry.fertilityHigh\",root:\"rootBees\",chromo:3b},4:{allele:\"forestry.toleranceNone\",root:\"rootBees\",chromo:4b},5:{allele:\"forestry.boolFalse\",root:\"rootBees\",chromo:5b},6:{allele:\"forestry.toleranceNone\",root:\"rootBees\",chromo:7b},7:{allele:\"forestry.boolFalse\",root:\"rootBees\",chromo:8b},8:{allele:\"forestry.boolFalse\",root:\"rootBees\",chromo:9b},9:{allele:\"forestry.flowersVanilla\",root:\"rootBees\",chromo:10b},10:{allele:\"forestry.floweringSlower\",root:\"rootBees\",chromo:11b},11:{allele:\"forestry.territoryDefault\",root:\"rootBees\",chromo:12b},12:{allele:\"forestry.effectNone\",root:\"rootBees\",chromo:13b}]}"
      },
      "requirements": [
        9
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a wasp",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Additions",
      "description": "The work begun by Jahl SpaceToad was too great for one man or even one family tocomplete and so one of the original BuildCraft founding families headed by Jahl AEnterprisebegun to carry our further research and development into complementary but more advancedtechnologies to those developed by Jahl SpaceToad. With a focus on developing usefulmachines and tools to advance the BuildCraft technologies, Jahl AEnterprise soon found hisskills and technologies in great demand.",
      "x": 62,
      "y": 29,
      "icon": {
        "id": "bcadditions:blockDusterBasic"
      },
      "requirements": [
        0,
        1
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Spooky Tree",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 15
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 30
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "eureka:engineeringDiary"
        }
      ]
    },
    {
      "name": "Logistics Pipes",
      "description": "Building on his tribes advances in BuildCraft and on the work by Jahl AEnterprise, a youngset of engineer?s that went by the names of theZorro and davboecki began exploring better ways to organise, transport and sortthe vast resources being accumulated by their people. their technical expertise was second tonone and the machinery that they where building to assist in automated crafting was a wonder tobehold ? vast multi-cogged and levered machines could be heard grinding away in theirchambers. It was theZorro and davboecki?s long held belief that they would one-day get to work with anothercombining their knowledge of logistics to create a truly limitless and flexible storage andautomated crafting system.",
      "x": 61,
      "y": 84,
      "icon": {
        "id": "ProjRed|Transmission:projectred.transmission.framewire",
        "damage": 34
      },
      "requirements": [
        3,
        6
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 20
            },
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Excavator/Core Sampler",
      "description": "Immersive Engineering has given you the ability to generate sustainable power. What do you intend to do with it? Turning chunks into dusts is child's play compared to what you could do with it. How about building a machine that can take the very ore from the ground itself? This is the Excavator. If you have the mind to build this monstrosity you will be well rewarded.",
      "x": 157,
      "y": 89,
      "icon": {
        "id": "ImmersiveEngineering:metalDevice",
        "damage": 14
      },
      "requirements": [
        3,
        13
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 20
            },
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "RailCraft",
      "description": "More info coming soon",
      "x": 206,
      "y": 10,
      "icon": {
        "id": "Railcraft:cart.loco.steam.solid",
        "nbt": "{model:\"railcraft:default\"}"
      },
      "requirements": [
        2
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Robotic Heart",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "Pneumatic Craft",
      "description": "A keen mind can take what at first seems normal and harmless and harness it for greater ends. So it was that Del A Mitry decided one day he had to change everything by discovering many other uses for simpleair. Through complex compression coupled to other scientific processes he discovered a whole new branch of technology called Pneumatics. Those who know this knowledge will never underestimate the power of air again. ",
      "x": 254,
      "y": 31,
      "icon": {
        "id": "PneumaticCraft:assemblyDrill"
      },
      "requirements": [
        11,
        28
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 15
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 30
            }
          ]
        }
      ]
    },
    {
      "name": "RFTools - Basic",
      "description": "Before you reach the heights of technological mastery you must master the basics. It is one thing to use RF; it is another to understand RF. These tools and blocks will help you gain that understanding so you are prepared for the next step.  ",
      "x": 203,
      "y": 54,
      "icon": {
        "id": "rftools:smartWrenchItem"
      },
      "requirements": [
        4,
        12
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a hammer in outline of gear",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 15
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "rftools:rfToolsManualItem"
        }
      ]
    },
    {
      "name": "Modular Armor",
      "description": "In the year 1009 Jahl Zeldo appointed Lord chbachman as head of the Icaran army. chbachman  was not at heart a warrior, but had spent the last few years working with his Nephew Tonius11 and tinkering with high-tech electronics. The end result was a set of designs and plans for a suit of powered armor chock-full of useful gadgets and features whichhe believed would give the Icaran?s overall dominance if war should ever darken their homeagain.",
      "x": 23,
      "y": 158,
      "icon": {
        "id": "ModularArmour:chestplateModular",
        "nbt": "{Energy:0,Capacity:100,UpgradeList:[],MaxTransfer:100}"
      },
      "requirements": [
        5,
        31
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with banded shield",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 50
            },
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 10
            }
          ]
        }
      ]
    },
    {
      "name": "RFTools - Advanced",
      "description": "Now you understand the basics it is time to truly realise the power of RF. Amateur?s smelt metals and crush ores; true masters manipulate time and space. By unlocking this knowledge you will be able to create pocket dimensions where every last detail  of the world will be your to design. Are you ready for such a responsibility?  ",
      "x": 157,
      "y": 200,
      "icon": {
        "id": "rftools:matterTransmitterBlock"
      },
      "requirements": [
        24,
        25,
        30
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Show you are by crafting XXXX of YYY and sitting in the chair of the room marked with a Bright Green banner with a blue spiraling Dimension in the temple.  ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 100
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "rftools:rfToolsManualDimensionItem"
        }
      ]
    },
    {
      "name": "MagnetiCraft",
      "description": "Bagshot McGubbins spent 6 months in the burns ward after forgetting to monitor the heat levels within his factory. A rookie mistake, he failed to understand the relationship between heat and electricity. Ever after known as Hot Bagshot McGubbins he was not allowed to forget his mistakes. It would be a terribleshame if you as one of the ",
      "x": 204,
      "y": 116,
      "icon": {
        "id": "Magneticraft:combustion_engine"
      },
      "requirements": [
        10,
        23
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Big Reactors",
      "description": "Having spent significant time in the Great Mines, an otherwise unremarkable resource team lead known as Erogenous Beef had been gathering supplies of ore previously thought to be nothing more than decorative in use - Yellorite.  ?Beef? had discovered that this ore, once processed, could be split in a reactor to generate significant heat and therefore power, once supplied with significant quantities of water for cooling.  Subsequent processing and refining then using as a reactor fuel with different types of cooling lead to Beef building cast reactors capable of producing great quantities of steam under varying conditions.  The level of control and power achieved by these Big Reactors and the uses for some of the byproducts made Beef  one of the most important engineers of his time with much of Outcasts switching to this source of power and making the previously common Yellorite rarer and more valuable.",
      "x": 214,
      "y": 165,
      "icon": {
        "id": "BigReactors:BRIngot"
      },
      "requirements": [
        16,
        20
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with nuclear symbol ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 60
            },
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "Open Computers",
      "description": "Being one of the old houses champions you are expected to tame this world using both your hands and your minds. You can chop down a tree but can you program a door to open automatically or turn the lights on and off? What about control a nuclear reactor with a keyboard? All these things will be yours if you prove your worth by handing the required materials in. Only then will the knowledge be opened to you. As for what you do with it; that is entirely up to you.  ",
      "x": 300,
      "y": 56,
      "icon": {
        "id": "OpenComputers:item",
        "damage": 106
      },
      "requirements": [
        12,
        28
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a antenna",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Compact Machines",
      "description": "Looks can be deceiving. What you see as one block can in fact be a whole factory. Yet to achieve this amazing feat of spatial dynamics requires specific tools. Even having the tools is not enough. You have to know what to do with it! When Drogo Narkal had the tools but not the knowledge he was last seen disappearing into a block; never to come out again. Such could be your fate if you don?t take the time to learn.  ",
      "x": 254,
      "y": 118,
      "icon": {
        "id": "CompactMachines:psd"
      },
      "requirements": [
        23
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "For the knowledge to be unlocked craft XXX of YYY which will unlock the gate to the robotic arm room in the temple.  ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Thermal Expansion",
      "description": "Fleeing the onslaught of the Magei, the Icarus tribe (lead by Jahl KingLemming) made theslopes and ancient lava tubes of Mt Atna their home, harnessing the power of heat and lava toadvance their knowledge and power. Using natural resources to drive Dynamo?s generating?Redstone Flux? as power, the Icarans developed an advanced technology involving energytransmission and a wide range of machines able to be fully augmented and upgraded tohigher and higher tiers. Compatible with many of the other tribes technologies, ThermalExpansion is core to many a Chosen One?s advancement.",
      "x": 254,
      "y": 146,
      "icon": {
        "id": "ThermalExpansion:Frame",
        "damage": 7
      },
      "requirements": [
        16,
        32
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Redstone Arsenal",
      "description": "?Power and knowledge breeds jealousy and fear in those that do not understand or wield it.?? Jahl Zeldo, 2nd Son of Jahl KingLemming. As he watched his family become morepowerful and learned in their chosen technology, Jahl Zeldo grew increasingly impatient andfearful of other tribes learning of his family\u0027s success. Over time, his fears turned to paranoiaand so Zeldo with a small band of followers took the knowledge and began to research how itcould be used defensively or as a weapon. Creating tools and armour that could be ?charged?with the energy generated by their Fathers dynamo?s, what followed was a period of great productivity resulting in the Icaran?s becoming increasingly tooled up! [lol]",
      "x": 298,
      "y": 155,
      "icon": {
        "id": "RedstoneArsenal:tool.battleWrenchFlux",
        "nbt": "{Energy:0}"
      },
      "requirements": [
        20,
        32
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a purple banner with yellow spikes",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 50
            },
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Simply Jetpacks",
      "description": "Jahl Zeldo, 2nd son of Jahl KingLemming of the Icaran?s had a close friend from another tribe? Jahl Tonius11. In awe of his friend?s development of weapons and armour, Tonius begandeveloping his own branch of era defining technology in the form of a range of poweredtransport devices that he began calling ?Jetpacks?.",
      "x": 158,
      "y": 60,
      "icon": {
        "id": "simplyjetpacks:jetpacks",
        "damage": 104,
        "nbt": "{Energy:20000000}"
      },
      "requirements": [
        4
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 30
            },
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Thermal Dynamics",
      "description": "Not satisfied with the significant thermal advances made by Jahl KingLemming, some of hisclosest protagonists formed a small faction to further advance the manipulation of power andfluids used by the Icarans. Known as TeamCOFH, this productive tight knit group ofengineers introduced a system of pipes and ducts that would help cement the Icaran?stechnological success story.",
      "x": 254,
      "y": 88,
      "icon": {
        "id": "ThermalDynamics:ThermalDynamics_0",
        "damage": 7
      },
      "requirements": [
        13,
        18
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 20
            },
            {
              "item": {
                "id": "beyondrealitycore:item3"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Tesseracts",
      "description": "Jahl KingLemming OCD had become unchecked. The automation, sorting and processingsystems he and his colleagues had developed were certainly impressive but the space, noiseand scale of the systems developed had grown unwieldy. Locking himself away for weeks ata time, in one last push for automated technological perfection, Jahl Chickenbones went toseek a way to transport items, fluids and power over long distances without the need for pipesand ducts of any kind.",
      "x": 263,
      "y": 192,
      "icon": {
        "id": "ThermalExpansion:Tesseract",
        "nbt": "{RSControl:1b,ModeEnergy:1b,ModeItems:1b,Frequency:-1,ModeFluid:1b}"
      },
      "requirements": [
        17,
        21
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a Person Transporting ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 80
            }
          ]
        }
      ]
    },
    {
      "name": "Matter Overdrive",
      "description": "The Outcast families working in isolation but also all heading towards the same technicalrevolution were about to make the final leap towards technical domination of Agartha and itsresources. From the original engineering feats performed by Jahl SpaceToad and theelectrical advances by Krapht and Algo2, a new manipulation of the world was emerging ?the ability to manipulate, replicate and transform. A pupil of Algo2 and an admirer of thework on Tesseracts by Jahl Chickenbones, Simeon Radivoev had been experimenting in hislaboratories for a number of years, building on his mentors achievements. But his work wasnot without risk and some believed that his latest advances were going too far ? for Simeon,the ultimate feat of engineering was to blend technology with the Agarthan race in the formof personal teleportation including his own physical transformation into an android. Thesefinal advances in technology are the ultimate engineering achievement.",
      "x": 55,
      "y": 192,
      "icon": {
        "id": "mo:matter_analyzer"
      },
      "requirements": [
        14,
        29
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with atomic symbol",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 80
            }
          ]
        }
      ]
    },
    {
      "name": "AE 2",
      "description": "Engineer?s theZorro and davboecki did not have to wait long to meet their technical soul mate they had beenwaiting for. Unbeknownst to them, an electrical and computing genius by the name ofAlgorithmX2 (known as Algo2) had been developing an energy based networked storage andmatter manipulation and crafting system that converted its contents into matter that could beinstantly transported throughout a network, with storage capacities increased enormouslywithin small devices. Algo2 had become stalled in his research until he was introduced totheZorro and davboecki by a mutual acquaintance. Their combined knowledge allowed the networking engineer to complete his work and development of his AE2 network.",
      "x": 157,
      "y": 139,
      "icon": {
        "id": "appliedenergistics2:tile.BlockSkyCompass"
      },
      "requirements": [
        16,
        27
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a blue banner with strange white computer DNA",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            },
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "RotaryCraft",
      "description": "To get wheel A to rotate at the correct speed will need wheel B to have the correct torque. For wheel B to have the correct torque requires engine C to spin at the correct rate which in turn needs motor D to have the correct power. I can see where this could all go wrong! Given the sheer number of variables you will need a firm grasp of math before maximizing your potential in this area. To do that will needspecialized knowledge that can only be found in the temple.  ",
      "x": 110,
      "y": 117,
      "icon": {
        "id": "RotaryCraft:rotarycraft_item_machine",
        "damage": 92
      },
      "requirements": [
        9,
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Project Red",
      "description": "Dwelling originally alongside SpaceToad and his BuildCraft engineers, two families grewtired of the laborious and limited levels of control and automation pioneered by theBuildCraft technologists. Well-read in mathematics and electronics, brothers Jahl Mr_TJP and Jahl Chickenbones lead their tribes away from SpaceToad, building on his ?limited?advances and in particular taking his experiments with a substance known as ?redstone? andusing it to develop advanced wiring, logic and control systems along with advanced sortingand machines. Plagued by OCD, Jahl Chickenbones pioneered building in miniature blockscreating levels of design and comfort not enjoyed by the other tribes.",
      "x": 300,
      "y": 10,
      "icon": {
        "id": "ProjRed|Integration:projectred.integration.gate",
        "damage": 24
      },
      "requirements": [
        2
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a Beige and Yellow Lightning Symbol",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item2"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "Advanced Generators",
      "description": "With the advances being made in ore processing by Master Huhlax, power consumption had reached all times highs and the drain on natural resources to power Huhlax?s furnaces was reaching unsustainable levels.  The technical Agrilahn?s were refusing to supply logs for the furnaces any more and so other methods of power generation had to be found.  To that end BDew was called away from his genetic work with the Agrilahns bee swarms to propose alternative methods of power generation.  Whilst his proposals did not completely rule out the use of fossil fuels to produce power, his focus was on efficient production using steam and other liquids to drive turbines and produce RF.",
      "x": 99,
      "y": 164,
      "icon": {
        "id": "advgenerators:TurbineRotorGold"
      },
      "requirements": [
        5,
        27
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with Green and black lightning symbol",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 60
            },
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "AE2 Stuff",
      "description": "As a champion of the Old Houses you are not expected to recreate the old world; you are expected to make it better.  That means using the old technologies to the full. If you unlock this knowledge you will have access to innovation that enhances Applied Energistics in ways which you as a champion will find very useful.  You will need this at some point if you want access to the most advanced technologies.  ",
      "x": 157,
      "y": 170,
      "icon": {
        "id": "ae2stuff:Grower"
      },
      "requirements": [
        17,
        26,
        29
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Craft and hand in XXX of YYY to gain access to the cube surrounded by atom\u0027s room in the temple.  ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item5"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Fluxpads and QuantumStorage",
      "description": "With tech becoming ever more prevalent on the old world, people struggled to keep everything they carried working. You had to carry the kit, you had to carry the chargers and you needed to carry the batteries. There must be a better way to keep everything going.  University Boffins realized the best way was to make the floor charge you when you walked over it. Using the latest techniques of miniaturization they managed to create pads that would keep you running. If you want access to this ancient tech please fulfill the requirements and visit the temple to gain the knowledge.                                                                     When champions set out in the world they carried everything with them. For quite a long time wooden storage was sufficient to keep everything in its place. However by progressing through technological advances the ability to produce more is expected. Unless you want to be surrounded by forests of wooden chests this is not a viable solution. Something deeper is needed. Quantum Storage will take an almost unlimited quantity of a single item and by using complex quantum equations store than in something that whilst the same size as normal chest is actually a pocket dimension.  ",
      "x": 15,
      "y": 111,
      "icon": {
        "id": "QuantumStorage:quantumdsu"
      },
      "requirements": [
        6,
        9
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Computronics",
      "description": "Lore Coming soon!",
      "x": 299,
      "y": 114,
      "icon": {
        "id": "computronics:computronics.tapeReader"
      },
      "requirements": [
        18,
        23
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item4"
              },
              "required": 50
            }
          ]
        }
      ]
    }
  ]
}
