{
  "name": "Tutorial",
  "description": "No description",
  "quests": [
    {
      "name": "Learning Divergence",
      "description": "You stand before a new world. Opportunity and risk shall be your companions. Fear and hope in equal measure will go where you go. Whether you find untold riches or end up cowering in a Zombie infested pit is as yet unknown. What is for sure is you will need all the help you can get!                                                                     Knowing this, with his dying breath, the Principle Librarian invoked the spirit of Zenodotus to guard the sacred Pyramid for all who would follow. Any who come through this temple will find themselves in possession of their very own copy of the Akashic, placed in their inventory by the guardian spirit.                                                                                               It will guide you as you seek to carve you mark upon this world. Heed it well and consult it often. You have been warned!  ",
      "x": 26,
      "y": 10,
      "icon": {
        "id": "eureka:engineeringDiary"
      },
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "If you havent already open up your spawn book and go over some of the features this pack changes. ",
          "items": [
            {
              "item": {
                "id": "Enchiridion2:book",
                "nbt": "{identifier:\"BeyondRealityDivergence\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "TConstruct:shovel",
          "nbt": "{InfiTool:{BaseDurability:121,Head:3,BaseAttack:4,ToolEXP:0,HarvestLevel:1,Attack:4,RenderHead:3,ModDurability:0.0f,Handle:0,Broken:0b,Shoddy:0.0f,RenderHandle:0,MiningSpeed:400,ToolLevel:1,Unbreaking:0,Damage:0,BonusDurability:0,TotalDurability:121,Modifiers:3},display:{Name:\"§rFlint Shovel\"}}"
        },
        {
          "id": "TConstruct:hatchet",
          "nbt": "{InfiTool:{BaseDurability:121,Head:3,BaseAttack:5,ToolEXP:0,HarvestLevel:1,Attack:5,RenderHead:3,ModDurability:0.0f,Handle:0,Broken:0b,Shoddy:0.0f,RenderHandle:0,MiningSpeed:400,ToolLevel:1,Unbreaking:0,Damage:0,BonusDurability:0,TotalDurability:121,Modifiers:3},display:{Name:\"§rFlint Hatchet\"}}"
        },
        {
          "id": "minecraft:furnace"
        }
      ]
    },
    {
      "name": "Lets start small!",
      "description": "When Callan led the Tratari to become one of the great houses he started from humble beginnings. Known as a man who never had two sticks to rub together he forged a mighty kingdom. By the sweat of his brow and the power of his hands he advanced their knowledge until splitting the atom was a trivial piece of science. You have some way to go before you reach these heady heights.                                                                                  To begin seat yourself in the chair in this room and then use your new found knowledge to craft the requested items.  ",
      "x": 68,
      "y": 81,
      "icon": {
        "id": "TConstruct:pickaxe",
        "nbt": "{InfiTool:{BaseDurability:60,Head:3,BaseAttack:3,Built:1b,HarvestLevel:1,Attack:3,RenderHead:3,ModDurability:0.0f,Handle:3,Broken:0b,Shoddy:0.0f,RenderHandle:3,Accessory:3,MiningSpeed:360,RenderAccessory:3,Unbreaking:0,Damage:0,BonusDurability:0,TotalDurability:60,Modifiers:3},display:{Name:\"§fFlint Pickaxe\"}}"
      },
      "requirements": [
        3
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Use the crafting station to craft some blank patterns. Use the stincle table to craft the blank patterns into what you need.",
          "items": [
            {
              "item": {
                "id": "TConstruct:blankPattern"
              }
            },
            {
              "item": {
                "id": "TConstruct:woodPattern",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "TConstruct:woodPattern",
                "damage": 9
              }
            },
            {
              "item": {
                "id": "TConstruct:woodPattern",
                "damage": 2
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:flint",
          "amount": 10
        },
        {
          "id": "minecraft:log",
          "amount": 5
        }
      ]
    },
    {
      "name": "Staying Alive",
      "description": "Think you can rule this world? You are not the first! Prove that you are worthy by first ruling your own needs. In the old worlds you were used to hunting, fishing and farming for food. To survive here will take more effort for in addition you will now need to keep yourself hydrated.                                                                              The tribes would be very upset if their chosen champion couldn?t even make it outside the temple before dying. Not to mention all the bodies gets very messy! Remember to consult the Akashic for guidance.  ",
      "x": 41,
      "y": 35,
      "icon": {
        "id": "enviromine:camelPack",
        "nbt": "{camelPackFill:0,camelPackMax:100,isCamelPack:1b}"
      },
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Toss some sand in a furnace to attain glass. Use that to craft a bottle. As a reward something that will keep you hydrated when worn.",
          "items": [
            {
              "item": {
                "id": "minecraft:glass_bottle"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "enviromine:camelPack",
          "nbt": "{camelPackFill:0,camelPackMax:100,isCamelPack:1b}"
        }
      ]
    },
    {
      "name": "The Temple",
      "description": "Now that you can keep yourself fed and watered it is time to explore the temple. Within the structure you will find the secrets of the tribes as gathered by the Principle Librarian. They are yours to unlock but only after you have earned them. The Pyramid is not a generous giver; everything has to be deserved. Seek out the first gate that unlocked in the hall of heros.  ",
      "x": 55,
      "y": 58,
      "icon": {
        "id": "chisel:templeblock",
        "damage": 2
      },
      "requirements": [
        2
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Moving Along",
          "items": [
            {
              "item": {
                "id": "enviromine:camelPack",
                "nbt": "{camelPackFill:0,camelPackMax:100,isCamelPack:1b}"
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:apple",
          "amount": 5
        },
        {
          "id": "TConstruct:ToolStationBlock"
        },
        {
          "id": "TConstruct:ToolStationBlock",
          "damage": 1
        },
        {
          "id": "TConstruct:ToolStationBlock",
          "damage": 10
        }
      ]
    },
    {
      "name": "Thou Shall Not Pass",
      "description": "Already many champions have decided to take an easier path. These new worlds, the glory and riches they contain, are not for them. Should you decide to go on in this world your resolve will be tested. Greater knowledge will require greater commitment. Prove that you have what it takes by crafting a flint pick and going out into the world. After that your path is yours to choose.                                                          Remember to keep coming back to the pyramid to unlock new knowledge.  ",
      "x": 87,
      "y": 108,
      "icon": {
        "id": "witchery:dupstaff"
      },
      "requirements": [
        1
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Go and put that pick to use. Gather 25 cobblestone of any variety to complete this task. When done look for the second gate that unlocks in the hall of heros",
          "items": [
            {
              "item": {
                "id": "HarderUnderground:unstable_stone",
                "damage": 3
              },
              "required": 25,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ExpandedIndustry:machine_wood_hopper",
          "amount": 3
        },
        {
          "id": "TConstruct:materials",
          "damage": 2,
          "amount": 64
        },
        {
          "id": "TConstruct:Smeltery"
        }
      ]
    },
    {
      "name": "Early Game Tech",
      "description": "In the Obsidian Hills old Trask the miner was the first person to develop early prospecting technology. Thanks to him mining efficiency across the world increased tenfold. You may not see the same level of gains as Trask because he was an experienced miner but you should see some. Prove that you have developed some expertise in mining by bringing the specific type of rock requested. When done seek out the gate that unlocked in the hall of heros",
      "x": 125,
      "y": 115,
      "icon": {
        "id": "ExpandedIndustry:machine_filter"
      },
      "requirements": [
        4
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Tutorials are not meant to be hard so hum yeah this random item will do. When completed look for the room that unlocks upon completion in hall of heros.",
          "items": [
            {
              "item": {
                "id": "minecraft:gravel"
              },
              "required": 10
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HarderWildlife:rainmeter"
        },
        {
          "id": "HarderWildlife:thermometer"
        },
        {
          "id": "HarderUnderground:engineer_goggles"
        },
        {
          "id": "HarderOres:machine_sifter"
        }
      ]
    },
    {
      "name": "Rails and Carts",
      "description": "Whilst you can spend the rest of your life mining and moving everything by hand you soon realise this is impractical. Unless you keep up with the other champions you will soon find yourself left behind. To keep up you will need to develop early automation using tracks and carts. Yet to build these takes resources. Keep the temple wood supply stocked and you will be rewarded with knowledge to aid your development.  Once done, look for the gate that unlocks in the hall of heros. ",
      "x": 80,
      "y": 145,
      "icon": {
        "id": "Railcraft:track",
        "damage": 736,
        "nbt": "{track:\"railcraft:track.slow\"}"
      },
      "requirements": [
        4
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Manual labor is a must in this harsh world prove your worth and gather 10 logs of any type to continue. When completed seek the room within the hall of heros that unlocks.",
          "items": [
            {
              "item": {
                "id": "minecraft:log"
              },
              "required": 10,
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:minecart"
        },
        {
          "id": "ExpandedIndustry:machine_cart_loader"
        },
        {
          "id": "ExpandedIndustry:rail_type_detector",
          "amount": 2
        },
        {
          "id": "TConstruct:rail.wood",
          "amount": 32
        }
      ]
    },
    {
      "name": "Steel and your done",
      "description": "Initially Trask was a regular visitor to the mining town of Big Nugget. Every two weeks he would come into town to sell his ore and buy new tools. When Orlan the new blacksmith took over the forge he offered to supply Trask with sturdier tools that he claimed would last twice as long. No one believed him but Trask was never one to pass up an advantage. Orlan?s tools meant he could mine more and come to town half as much. Soon others took an interest and so the legend of Steel was born!",
      "x": 125,
      "y": 157,
      "icon": {
        "id": "TSteelworks:HighOven"
      },
      "requirements": [
        5,
        6
      ],
      "parentRequirement": 1,
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Due to the level of progression needed towards becoming a better miner. You will require better materials to craft your picks out of. We will grant you the knowledge of this amazing alloy so you can fulfil the rest of our task.                                                                  Your going to need some iron for this task. Gather at least 10 and we will give you the charcoal needed to get this going! Once inside heat it to at least 1k and toss the iron in. You will find items needed to build your own in the last room that unlocks in the hall of heros.",
          "items": [
            {
              "item": {
                "id": "minecraft:iron_ingot"
              },
              "required": 10
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:coal",
          "damage": 1,
          "amount": 30
        },
        {
          "id": "minecraft:redstone",
          "amount": 5
        },
        {
          "id": "minecraft:sand",
          "amount": 5
        },
        {
          "id": "minecraft:gunpowder",
          "amount": 5
        }
      ]
    }
  ]
}