{
  "name": "Magic Research",
  "description": "Use the power of the runic alter and mana to make amplifications to research into the magical arts.",
  "quests": [
    {
      "name": "Thaumcraft",
      "description": "Par Salien?s apprentice Sgoria took the principles learned from his mentor and began to apply them to inanimate objects. If flowers had mystical properties then surely everything must have some aspect of magic associated with it? He spent his life travelling the world cataloguing the aspects of everything he came into contact with. In his later years when he could no longer travel he passed on his knowledge; distinguishing his own knowledge from the botany of his mentor. Thus Thaumaturgy was born. ",
      "x": 35,
      "y": 19,
      "bigIcon": true,
      "icon": {
        "id": "Thaumcraft:ItemThaumometer"
      },
      "requirements": [
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Craft 30 Notable Magical Amplification and hand them in to unlock this new area of aura?s and aspects. Through the path marked by a XXXX",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item6"
              },
              "required": 30
            }
          ]
        }
      ]
    },
    {
      "name": "Witchery",
      "description": "Without realising it, Par Salien put in place the circumstances for his own demise. He only cared about the gardens yet he could not control the magic he unleashed. Others did not have the same morals so were more inclined to use magic for their own ends. In particular one of Par Salien?s young apprentices called Sarans Sine Pol began to use the flowers of this world to create infusions and brews that gave him unnatural powers. As he delved deeper he slowly began to lose his soul. Never did he imagine where this would lead. ",
      "x": 228,
      "y": 62,
      "bigIcon": true,
      "icon": {
        "id": "witchery:poppet",
        "nbt": "{WITCDamage:0}"
      },
      "requirements": [
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item7"
              },
              "required": 25
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "witchery:cauldronbook"
        }
      ]
    },
    {
      "name": "Shamanry",
      "description": "Throughout her travels Sgoria found herself faced with many situations that were completely new to her. It?s fair to say she handled some better than others. The Raksal incident was not her finest hour. Over time Sgoria realised her actions had a direct effect on the way magic responded to her through a series of set rituals. This ?Karma? as she called it was actively cultivated to give life to increasingly powerful magical rituals. ",
      "x": 83,
      "y": 59,
      "icon": {
        "id": "shamanry:blockRitualAltar"
      },
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item7"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Thaumic Upholstry",
      "description": "Par Salian had created many new items. Not only that he also learned to augment existing magical items such as armour, weapons and harnesses. This proved hugely useful in that it allowed people to personalise their kit to more truly reflect who they were. A useful trait you may wish to learn!",
      "x": 12,
      "y": 58,
      "icon": {
        "id": "TU:RobesHelmet"
      },
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item7"
              },
              "required": 15
            }
          ]
        }
      ]
    },
    {
      "name": "Automagy",
      "description": "As her knowledge increased Sgoria found she could no longer do everything need to keep things running and still have time to discover new magic. Rather than give up she chose to develop magical automation that would then free her time for travel and discovery. Others who saw the way this took care of mundane task soon adopted her practices. Thus was born the sphere of Automagy.",
      "x": 9,
      "y": 118,
      "bigIcon": true,
      "icon": {
        "id": "Automagy:blockReqTome"
      },
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item8"
              },
              "required": 30
            }
          ]
        }
      ]
    },
    {
      "name": "HexCraft",
      "description": "Where does power lie? Is it only in imposing your will on others? Or is there power in inspiring others through beauty? Sgoria wasn?t the only one to build on Par Salien?s work as Tor Axian from the old Magei family of Laxor brought together the mystical infused crystals to make magnificent constructions. Axian believed the magic that bound these crystals would give his buildings an ethereal quality. Not only would they speak to the eyes; they would also talk to the soul.",
      "x": 267,
      "y": 23,
      "bigIcon": true,
      "icon": {
        "id": "chisel:hexPlating",
        "damage": 1
      },
      "requirements": [
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Craft 20 Notable Magic Amplifications and hand them in to unlock greater magical opportunities.                                                                       For your reward access to the *******",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item6"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "Aura Cascade",
      "description": "After visiting Tar Xegroth, head of house Valen, Morbh Dubha demanded his own gardens be made even more spectacular. They were to surpass anything Par Salian had created. No tall order for his head gardner Tormod. Morbh Dubha was not known as a compassionate man and Tormod knew his future depended on delivering something spectacular! After many months Tormod finally unveiled a magnificent garden where the magic literally flowed alongside the flowers. There was beauty, there was movement. For the moment he was safe from his tyrant overlord. ",
      "x": 177,
      "y": 62,
      "bigIcon": true,
      "icon": {
        "id": "aura:AuraCrystal"
      },
      "requirements": [
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item7"
              },
              "required": 20
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "aura:lexicon"
        }
      ]
    },
    {
      "name": "Blood Magic",
      "description": "Sarans Sine Pol grew in power and might until he rivalled even the great Par Salian himself; yet he wanted more. Whilst Par Salian was content to build upon his knowledge by careful step Sarans would do whatever it took to reach his goal of ultimate unrivalled unabridged power. He began by sacrificing chickens then sheep and then cows. Soon he moved on to Zombies and Skeletons but even they were not enough. Finally he realised the blood of innocents held significant power when he abducted Par Salien himself. His reasoning was that a great man should have great power in the blood.",
      "x": 267,
      "y": 130,
      "bigIcon": true,
      "icon": {
        "id": "AWWayofTime:sacrificialKnife",
        "nbt": "{sacrifice:0b}"
      },
      "requirements": [
        1,
        5
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item8"
              },
              "required": 50
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "guideapi:ItemGuideBook",
          "nbt": "{CreativeBook:0b}"
        }
      ]
    },
    {
      "name": "Sanguimancy",
      "description": "Sarans power was now complete. His total mastery through blood magic allowed him to have no equals but there was a cost. Whilst going through Par Salian?s writings he discovered a hidden compartments in Par Salian?s desk that held a shocking discovery. Sarans Sine Pol who was so beloved by the old man was none other than Par Salian?s Son. In his quest for power he had murdered his own father. Even now he could feel the corruption of blood magic seep any residual good from his soul. Beware what this magic may cost you!",
      "x": 267,
      "y": 184,
      "bigIcon": true,
      "icon": {
        "id": "Sanguimancy:corruptedSword"
      },
      "requirements": [
        7
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item9"
              },
              "required": 60
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "guideapi:ItemGuideBook",
          "damage": 1,
          "nbt": "{CreativeBook:0b}"
        }
      ]
    },
    {
      "name": "Witching Gadgets",
      "description": "A magical truth is the more you learn of what you don?t know the more you actually know. With Thaumian energy being found in almost all of creation it soon became apparent there were huge areas of knowledge still to be discovered. Knowing this knowledge was out there drove the expansion of Thaumcraft into new realms of gadgets and such.",
      "x": 66,
      "y": 118,
      "bigIcon": true,
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item8"
              },
              "required": 30
            }
          ]
        }
      ]
    },
    {
      "name": "Botania",
      "description": "Did you ever see the magnificent gardens in the citadel of Tar Xegroth? Everywhere there were flowers of the most beautiful shades. People who travelled from all over Agartha made the trip at least once in their lives. Par Salien, head gardener maintained there was more to the flowers than mere colour; that they had a mystical quality. Over many years more and more people came to the same conclusion. That nature and natural apparatus could have a magic all their own. ",
      "x": 153,
      "y": 14,
      "bigIcon": true,
      "icon": {
        "id": "Botania:pylon"
      },
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Before you embark on your journey of magical exploration show you have grasped the magic present in all things. Create 20 mana infused ingots and you will be rewarded with basic knowledge of how to manipulate nature to harness its magical properties.                                                                 Your reward access to the the first room on the left in the magic ward.",
          "items": [
            {
              "item": {
                "id": "ThermalFoundation:material",
                "damage": 70
              },
              "required": 20
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Botania:lexicon"
        }
      ]
    },
    {
      "name": "TerraSteel",
      "description": "Being driven by the tyrant to create ever more beautiful creations Tormod found he could not keep up. Thousands of miners died in the caves looking for crystals. Others were poisoned after too much exposure to the mana streams. He need a more effective method of getting the crystal quicker. Many months passed before he turned to the guild of artificers who after much experimentation hit upon a new alloy terrasteel. Difficult to work, expensive to make, yet devastatingly effective, Tormod finally had the solution he was looking for. ",
      "x": 204,
      "y": 184,
      "bigIcon": true,
      "icon": {
        "id": "Botania:terraPick",
        "nbt": "{mana:9999}"
      },
      "requirements": [
        1,
        6
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with a Burning Meteor. ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item9"
              },
              "required": 60
            }
          ]
        }
      ]
    },
    {
      "name": "Forbidden Magic",
      "description": "Sgoria soon became a person of note which led to many proposals of marriage from suitors both suitable and not. When she finally wed Manatoth in the gardens of Tar Xegroth almost the whole city turned out in support. Manatoth however was not all he seemed for under their new home he constructed secret laboratories where he was free to explore darker, forbidden aspects. He could never had imagined where this would lead. ",
      "x": 35,
      "y": 184,
      "bigIcon": true,
      "icon": {
        "id": "ForbiddenMagic:DiabolistFork"
      },
      "requirements": [
        0
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item9"
              },
              "required": 20
            }
          ]
        }
      ]
    },
    {
      "name": "SF Artifacts",
      "description": "On studying the Laxor murals there were hints of great hammers and mighty shields. Magic infused weapons had been depicted in legend though no one really believed they had ever existed. The best preserved of the murals gave pointers to how to create these weapons of legend. Difficult and arduous the end results proved to be well worth it. ",
      "x": 155,
      "y": 184,
      "bigIcon": true,
      "icon": {
        "id": "sfartifacts:sfartifacts_blockHammerStand",
        "damage": 1
      },
      "requirements": [
        6,
        14
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item9"
              },
              "required": 70
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "sfartifacts:sfartifacts_itemManual"
        }
      ]
    },
    {
      "name": "ChromatiCraft",
      "description": "With your new found knowledge of the connections between nature and magic you realise this goes further than you previously thought. Magical energy can be found throughout the world, particularly amongst its cave systems and the majestic crystals found therein. Par Salien used these as the centrepiece of his garden sculptures. Sadly little now remains except what we see in the Laxor murals. They truly were a beauty to behold.                                                                                                               The murals point to crystals being more potent than you have so far experienced. However this knowledge is not going to come easy as there is little to go on. Is the risk worth the reward? What could go wrong? You are not sure if it is wise trying to surpass the great Par Salien but you know you need to try.",
      "x": 132,
      "y": 62,
      "bigIcon": true,
      "icon": {
        "id": "ChromatiCraft:chromaticraft_item_tool"
      },
      "requirements": [
        10
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item7"
              },
              "required": 30
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ChromatiCraft:chromaticraft_item_help"
        }
      ]
    },
    {
      "name": "Soul Shards",
      "description": "The greatest mages of the old world held dominion over both body and soul. For some sad individuals not even death was a release as necromages could command souls to come forth at will. This power is not for the faint hearted and many mages have died in a horde of Zombies after losing control. Do you dare to unlock this knowledge? Of course you do! ",
      "x": 106,
      "y": 118,
      "bigIcon": true,
      "icon": {
        "id": "Botania:enderDagger"
      },
      "requirements": [
        0,
        14
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "Make XXX or YYY. Hand them in and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item8"
              },
              "required": 50
            }
          ]
        }
      ]
    },
    {
      "name": "Reliquary",
      "description": "There are certain ?artifacts? in the world that will help you on your journey. Xeno who created them designed these to aid intrepid adventurers in making the world their own. You have therefore no excusefor failure. Like everything else you need to earn your access to these by the sweat of your brow.  ",
      "x": 85,
      "y": 184,
      "bigIcon": true,
      "icon": {
        "id": "xreliquary:mercy_cross"
      },
      "requirements": [
        9,
        15
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "longDescription": "To unlock this knowledge make XXX of YYY and hand them in. Then find and use the chair in the room marked with ZZZZ ",
          "items": [
            {
              "item": {
                "id": "beyondrealitycore:item9"
              },
              "required": 60
            }
          ]
        }
      ]
    }
  ]
}